In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\tanvi\appdata\local\programs\python\python310\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.22.4 in c:\users\tanvi\appdata\local\programs\python\python310\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\tanvi\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\tanvi\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\tanvi\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: six>=1.5 in c:\users\tanvi\appdata\local\programs\python\python310\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.3.1 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [ ]:
import pandas as pd #import

In [3]:
import pandas as pd

data=[1,2,3,4,5]
series=pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
# series from dictionary

data={'a':1,'b':2,'c':3}
series=pd.Series(data)
print(series)

a    1
b    2
c    3
dtype: int64

In [23]:
#data frame

data={
    'Name':['Tanvi','Bobo','Fang'],
    'Age':[21,22,22],
    'city':['Mumbai','Kuala Lumpur','TAPOS']
}

df=pd.DataFrame(data)
print(df)

    Name  Age          city
0  Tanvi   21        Mumbai
1   Bobo   22  Kuala Lumpur
2   Fang   22         TAPOS

In [11]:
#data frame

data=[
    {'Name':'Tanvi','Age':21,'city':'Mumbai'},
    {'Name':'Bobo','Age':22,'city':'Kuala Lumpur'},
    {'Name':'FANG','Age':22,'city':'TAPOS'},
    
]

df=pd.DataFrame(data)
print(df)

    Name  Age          city
0  Tanvi   21        Mumbai
1   Bobo   22  Kuala Lumpur
2   FANG   22         TAPOS

In [18]:
df2=pd.read_csv('data.csv')

In [19]:
df2.head(5)

         Date Category  Value   Product  Sales Region
0  01-01-2023        A   28.0  Product1  754.0   East
1  02-01-2023        B   39.0  Product3  110.0  North
2  03-01-2023        C   32.0  Product2  398.0   East
3  04-01-2023        B    8.0  Product1  522.0   East
4  05-01-2023        B   26.0  Product3  869.0  North

In [20]:
df['Name']

KeyError: 'Name'

In [25]:
df.iloc[0]

Name     Tanvi
Age         21
city    Mumbai
Name: 0, dtype: object

In [26]:
df['Name']

0    Tanvi
1     Bobo
2     Fang
Name: Name, dtype: object

In [27]:
df.at[1,'Age']

22

In [30]:
df['salary']=[50000,60000,70000]
df

    Name  Age          city  salary
0  Tanvi   21        Mumbai   50000
1   Bobo   22  Kuala Lumpur   60000
2   Fang   22         TAPOS   70000

In [34]:
df['Age']=df['Age']+1
df

    Name  Age          city  salary
0  Tanvi   25        Mumbai   50000
1   Bobo   26  Kuala Lumpur   60000
2   Fang   26         TAPOS   70000

In [35]:
df2.describe()

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000